Revit 2027 API
ExportLineweightInfo(ExportLineweightInfo) Constructor
 Constructs a new copy of the input ExportLineweightInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightInfo(
	ExportLineweightInfo other
)
Public Sub New (
	other As ExportLineweightInfo
)
public:
ExportLineweightInfo(
	ExportLineweightInfo^ other
)
new :
        other : ExportLineweightInfo -> ExportLineweightInfo
Parameters
other ExportLineweightInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightInfo Class
ExportLineweightInfo Overload
Autodesk.Revit.DB Namespace